
/*
        프로그램 개요 :

        마우스 이벤트를 기준으로, 컴퓨터를 장시간 이용하지 않으면 알림음을 출력하는 간단한 프로그램
        기본 기능 구현 후 사용자가 자유롭게 사운드를 등록하여 사용할 수 있도록 GUI 제작 예정
        exe 배포를 염두로 하여 JAVA17보다 JAVA11을 채택

        개발 기간 : 2022.12.26 ~ 2023.01.??
        개발자 : 이지현
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");


        // 비활성 시간 카운트용 스레드 생성
        // 스레드 내에서 비활성 시간이 x초를 경과하면 사용자 사운드 랜덤 재생
        // 재생 후 비활성 시간 0으로 초기화


        // 마우스 움직임 이벤트 리스너로 비활성 시간 0으로 초기화

    }
}